---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.Perimeter
source: html/e29f2e34-c1fb-d5af-1f99-e26d36799885.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.Perimeter Property

Painting surface of the unit length.

## Syntax (C#)
```csharp
public double Perimeter { get; set; }
```